// Letters.js
import haminjpeg from "../assets/img/hamin.jpeg";
import firstcon from "../assets/img/first-con.jpg";
import encorecon from "../assets/img/encore-con.jpg";
import debut100 from "../assets/img/debut100.JPG";
import topastmyself from "../assets/img/to-past-myself.JPG";
import popupstore from "../assets/img/pop-up-store.JPG";
import hamindad from "../assets/img/hamin-dad.JPG";
import haminmom from "../assets/img/hamin-mom.JPG";

export const letters = [
  {
    title: "出道100天",
    description: "2023.06.18",
    imgUrl: debut100,
    translation:
  `大家好，我是河玟！🐈‍⬛
      
100天的時間好快就到了！
  
感謝100天來的幸福和感激，
  
今後也請像現在一樣度過健康幸福的時光：）
  
💙💜❤️💗🖤`,
  },
  {
    title: "現代首爾百貨快閃店",
    description: "2024.03.01",
    imgUrl: popupstore,
    translation: `噗哩們大家好呀:)
我是PLAVE的河玟。
感覺初放送時，因為認生而顯得尷尬的樣子好像還在眼前，像是過了三年那麼久，結果只是一年前而已啊。這一年間和噗哩們一起的回憶，真的是無法取代的，現在已經成為我不可或缺的存在了。
你們總是對我說許多美好的話語和稱讚，往後也請多多關照啦ㅎㅎ我也會對噗哩們多多說好話、給你們稱讚哦！噗哩好聰明！是「讚讚博士」！關到「稱讚監獄」~~！！
不管在哪裡，我都會陪在你們身邊，所以不要擔心！！我會讓你們每時每刻都能笑開懷，所以哪裡也不准去哦！！
還有，有時候我收到你們的信，看到信裡寫著「在自己真的很辛苦的時候遇到了PLAVE，因為PLAVE而笑了，也得到了幸福」，每當看到這樣的話時，我就會覺得自己真的成功了。我會努力成為能夠給予大家力量、帶來正面影響的人，也會用行動去愛你們的。
噗哩們，祝我們的一周年快樂，有噗哩真的讓我覺得很驕傲、很幸福。
ㄨㄏㄞㄋㄇ♡。`,
  },
  {
    title: "初次演唱會",
    description: "2024.04.13",
    imgUrl: firstcon,
    translation: `To 噗哩

大家好，我是噗哩引以為傲的歌手河玟。

來參加演唱會的路上還順利嗎？希望大家都平安到達，也非常感謝你們充滿熱情地來參加。在這段辛苦的過程中，你們依然帶著明亮的笑容，給了我無數的勇氣。

多虧了噗哩們，我們才能舉辦這麼棒的演唱會。在這個空間裡和大家一起唱PLAVE的歌、一起享受音樂，真的沒有比這更幸福的事情了。

以這次的初次演唱會為起點，未來我們會呈現更多有趣且充滿魅力的舞台，我會一直努力，成為你們心中永遠的歌手。哪裡都不會去，會一直和大家在一起的。

讓我們一起幸福地走下去，在困難的時刻也一起克服。希望大家回家平安，我會再用訊息聯絡大家的。我真的很自豪，也為我們能互相依靠而感動。我愛你們。`,
  },
  {
    title: "安可演唱會",
    description: "2024.10.05",
    imgUrl: encorecon,
    translation: `To 噗哩

大家好，我是河玟。

首先，真的很感謝你們今天特地來看我們的演出！演唱會怎麼樣？玩得開心嗎？你們肯定喊了很多次吧…嗓子還好嗎？無論如何，只要你們感到幸福，那麼這次演唱會就是成功的。

希望你們能把今天的回憶珍藏一輩子，我也一定會牢記這段珍貴的回憶。

謝謝你們讓我有勇氣說出「我愛你」，也謝謝你們給予的愛。有太多感謝的話語，我會慢慢地表達出來的。我真的很愛你們。

回去的路上也請注意安全，記得小心車輛！也要小心人潮！平平安安回家，然後到家後一定要聯絡噢！

今天也是托噗哩們的福，我度過了一個幸福的一天！`,
  },
  {
    title: "一週年給過去的自己",
    description: "2024.03.12",
    imgUrl: topastmyself,
    translation: `To 過去的河玟
河玟啊，你好，我是來自未來的河玟。首先，比起用話語表達，我更想先給你一個擁抱。雖然對自己說話有點尷尬，但我準備了一些想給你力量的話。現在狀態怎麼樣？我現在每天都過得非常非常幸福。那是你未來將會體驗到的幸福，雖然不能透露細節。不過，你現在可能處於有些艱難的時刻吧。記憶中一些場景在腦海掠過。練習後錯過末班車，徹夜等待第一班車時，邊走邊聽音樂的時候；在家裡的小鏡子前，每天練舞2.3小時的時候；比起得到人們的認同，更多被忽視的時候；感覺夢想逐漸變得渺小的時候；還有下定決心要放棄音樂的時候。這些最困難的時刻，你一個人獨自戰鬥、獨自受傷、獨自克服。未來讓人感到不安和害怕吧？現在我可以給你這個問題的確切答案了。你所擔心的事情不需要那麼擔憂，會比你期待的更加幸福的。所以別讓這些艱難的時刻傷害你，像平時一樣，堂堂正正、努力地準備吧。未來會有很多人喜歡你的音樂和舞蹈，而且最重要的是，我變得更愛自己了。即使現在痛苦難熬，也請堅持住，因為將來有許多人需要你守護，你要變得更強大。最後，如果偶然遇見叫韓諾亞的人，一定要讓他注意到你。雖然無法透露其他細節，但一定要讓叫做諾亞的人成為你的人，知道嗎？他是會成為家人的人呀。那麼，河玟啊，我愛你，我會成為你一輩子的朋友。今天也辛苦了，祝你好夢，再見。
From 你最好的朋友`,
  },
  {
    title: "家庭日爸爸的信",
    description: "Letter from Hamin",
    imgUrl: hamindad,
    translation: "",
  },
  {
    title: "家庭日媽媽的信",
    description: "Letter from Hamin",
    imgUrl: haminmom,
    translation: "",
  },
];
